In [ ]:
import sqlite3

# SQLite DB 연결
conn = sqlite3.connect("test.db")

# Connection 으로부터 Cursor 생성
cur = conn.cursor()

# SQL 쿼리 실행
sql = "select * from customer where category=? and region=?"
cur.execute(sql, (1, 'SEA'))

# sql = "select * from customer where id = :Id"
# cur.execute(sql, {"Id": 1})


# 데이타 Fetch
rows = cur.fetchall()
for row in rows:
    print(row)

# Connection 닫기
conn.close()

In [ ]:
conn = sqlite3.connect("test.db")
# Autocommit 사용시:
# conn = sqlite3.connect("test.db", isolation_level=None)
 
cur = conn.cursor()
sql = "insert into customer(name,category,region) values (?, ?, ?)"
cur.execute(sql, ('홍길동', 1, '서울'))
conn.commit()
 
conn.close()

In [ ]:
conn = sqlite3.connect("test.db")
cur = conn.cursor()
 
data = (
    ('홍진우', 1, '서울'),
    ('강지수', 2, '부산'),
    ('김청진', 1, '서울'),
)
sql = "insert into customer(name,category,region) values (?, ?, ?)"
cur.executemany(sql, data)
 
conn.commit()
conn.close()

In [ ]:
conn = sqlite3.connect("test.db")
 
with conn:
    cur = conn.cursor()
    cur.execute("select * from customer")
    rows = cur.fetchall()
 
    for row in rows:
        print(row)

In [ ]:
# pymssql 패키지 import
import pymssql
 
# MSSQL 접속
conn = pymssql.connect(host=r"(local)", database='MyDB', charset='utf8')
 
# Connection 으로부터 Cursor 생성
cursor = conn.cursor()
 
# SQL문 실행
cursor.execute('SELECT * FROM Customer;')
 
# 데이타 하나씩 Fetch하여 출력
row = cursor.fetchone()
# row = cursor.fetchone()
# row = cursor.fetchmany('n')
while row:
    print(row[0], row[1])
    row = cursor.fetchone()

#연결 끊기
conn.close()

In [ ]:
import json
 
# 테스트용 Python Dictionary
customer = {
    'id': 152352,
    'name': '강진수',
    'history': [
        {'date': '2015-03-11', 'item': 'iPhone'},
        {'date': '2016-02-23', 'item': 'Monitor'},
    ]
}
 
# JSON 인코딩
jsonString = json.dumps(customer)
 
# 문자열 출력
print(jsonString)

In [ ]:
# 테스트용 JSON 문자열
jsonString = '{"name": "강진수", "id": 152352, "history": [{"date": "2015-03-11", "item": "iPhone"}, {"date": "2016-02-23", "item": "Monitor"}]}'
 
# JSON 디코딩
dict = json.loads(jsonString)
 
# Dictionary 데이타 체크
print(dict['name'])
for h in dict['history']:
    print(h['date'], h['item'])

In [ ]:
conn = sqlite3.connect("employee.db") 
cur = conn.cursor() 
conn.execute('CREATE TABLE employee_data
             (id INTEGER, name TEXT, nickname TEXT, 
              department TEXT, employment_date TEXT)') 

cur.executemany('INSERT INTO employee_data VALUES (?, ?, ?, ?, ?)', 
                [(1001, 'Donghyun', 'SOMJANG', 'Development', '2020-04-01 00:00:00.000'), 
                 (2001, 'Sol', 'Fairy', 'Marketing', '2020-04-01 00:00:00.000'), 
                 (2002, 'Jiyoung', 'Magician', 'Marketing', '2020-04-01 00:00:00.000'), 
                 (1002, 'Hyeona', 'Theif', 'Development', '2020-04-01 00:00:00.000'), 
                 (1003, 'Soyoung', 'Chief', 'Development', '2020-04-01 00:00:00.000') ] ) 

conn.commit() 
conn.close()

In [ ]:
conn = sqlite3.connect("employee.db") 
cur = conn.cursor() 
cur.execute("SELECT * FROM employee_data") 
rows = cur.fetchall() 

for row in rows: 
    print(row) 

conn.close()

In [ ]:
import pandas as pd 

conn = sqlite3.connect("employee.db") 
cur = conn.cursor() 
cur.execute("SELECT * FROM employee_data") 
rows = cur.fetchall() 
cols = [column[0] for column in cur.description] 
data_df = pd.DataFrame.from_records(data=rows, columns=cols) 
conn.close() 

data_df

# DDL

scheme, domain, table, view, index
⒜ CREATE : 정의 
⒝ ALTER: 수정 
    - ADD : ALTER TABLE `테이블명` ADD `컬럼명` 자료형 FIRST/AFTER
    - DROP : ALTER TABLE `테이블명` DROP `컬럼명`;
    - CHANGE : ALTER TABLE `테이블명` CHANGE `기존컬럼명` `새컬럼명` 자료형
    - MODIFY
⒞ DROP : 삭제
⒟ TRUNCATE : DROP 후 CREATE

SHOW TABLE STATUS
CREATE TABLE tableA (str varchar(8), PRIMARY KEY (str));
CREATE TABLE dept (
  dept_no INT(11) unsigned NOT NULL,
  dept_name VARCHAR(32) NOT NULL,
  PRIMARY KEY (dept_no)
);
CREATE TABLE posts ( 
  id bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  subject varchar(255) NOT NULL,
  content mediumtext,
  created datetime,
  user_id int(10) unsigned NOT NULL,
  user_name varchar(32) NOT NULL,
  hit int(10) unsigned NOT NULL default '0',  
  PRIMARY KEY (id)
);
DESC table_name

# 상태 확인

SELECT * FROM information_schema.`COLUMNS`  
WHERE information_schema.`COLUMNS`.TABLE_SCHEMA = 'test'  
AND information_schema.`COLUMNS`.COLUMN_NAME LIKE '%id%';  

SHOW VARIABLES LIKE 'slow_query_%';

# DML

⒜ SELECT : 조회
SELECT * FROM INFORMATION_SCHEMA.TABLES where table_name='테이블명';

날짜 조회 :
SELECT id, post_date FROM wp_posts2 WHERE DATE(post_date)='2012-01-22';
SELECT id, post_date FROM wp_posts2 WHERE DATE(post_date) BETWEEN '2012-01-22' AND '2012-01-23';

월별 조회 : 
SELECT COUNT(*) FROM wp_posts;
SELECT ID, post_date FROM wp_posts ORDER BY post_date LIMIT 2;
SELECT ID, post_date FROM wp_posts ORDER BY post_date DESC LIMIT 2;
SELECT DATE_FORMAT(post_date,'%Y-%m') m, COUNT(*) FROM wp_posts GROUP BY m;
SELECT MID(post_date,1,7) m, COUNT(*) FROM wp_posts GROUP BY m;
SELECT CONCAT(YEAR(post_date), '-', MONTH(post_date)) ym, COUNT(*) FROM wp_posts GROUP BY ym;

⒝ INSERT : 추가
INSERT INTO tableA (str) VALUES ('A'), ('B'), ('C'), ('D');
INSERT IGNORE INTO 테이블명 [컬럼1, 컬럼2, ...] VALUES (값1, 값2, ...);


⒞ DELETE : 삭제
DELETE a FROM table1 a LEFT JOIN table2 b ON ...

⒟ UPDATE : 변경
REPLACE INTO 테이블명 [컬럼1, 컬럼2, ...] VALUES (값1, 값2, ...);
INSERT INTO heroes
    (name)
VALUES
    ('이순신'),('윤봉길')
ON DUPLICATE KEY UPDATE
    name = CONCAT(VALUES(name), idx);



lock
explain
call

SELECT column_name FROM information_schema.columns WHERE table_name ='table1';

INSERT INTO tableA (str) VALUES ('A'), ('B'), ('C'), ('D');

# DCL

데이터의 보안, 무결성, 회복, 병행 수행제어

⒜ COMMIT : 트랜잭션의 작업 결과를 반영 
⒝ ROLLBACK : 트랜잭션의 작업을 취소 및 원래대로 복구
⒞ GRANT : 사용자에게 권한 부여
⒟ REVOKE : 사용자 권한 취소  
CREATE USER 'finley'@'localhost' IDENTIFIED BY 'P@ssw0rd';  
GRANT ALL ON *.* TO 'finley'@'localhost' WITH GRANT OPTION;  
DROP USER '계정'@'접속대역';  

SELECT @@GLOBAL.log_output;  
SELECT @@GLOBAL.general_log;  
SET GLOBAL log_output = 'table';  
SET GLOBAL general_log = 1;  
SELECT * FROM mysql.general_log;

# View

CREATE VIEW DEPT_INFO(Dept_name, No_of_emps, Total_sal)
AS SELECT Dname, COUNT(*), SUM(Salary)
FROM DEPARTMENT, EMPLOYEE
WHERE Dnumber=Dno
GROUP BY Dname;

# Join

A 집합 :  
SELECT *
FROM 테이블1 LEFT OUTER JOIN 테이블2
ON 테이블1.컬럼=테이블2.컬럼;
SELECT *
FROM 테이블1 LEFT JOIN 테이블2
ON 테이블1.컬럼=테이블2.컬럼;

B 집합 :
SELECT *
FROM EMPLOYEE E RIGHT OUTER JOIN DEPARTMENT D
ON E.DepartmentID = D.DepartmentID;

합집합 :  
SELECT str FROM tableA
UNION
SELECT str FROM tableB;

SELECT *
FROM EMPLOYEE E FULL OUTER JOIN DEPARTMENT D
ON E.DepartmentID = D.DepartmentID;


교집합 :  
SELECT a.str 
FROM tableA a, tableB b 
WHERE a.str = b.str;
SELECT *
FROM EMPLOYEE INNER JOIN DEPARTMENT
ON EMPLOYEE.DepartmentID = DEPARTMENT.DepartmentID;
SELECT *
FROM EMPLOYEE, DEPARTMENT
WHERE EMPLOYEE.DepartmentID = DEPARTMENT.DepartmentID;

차집합 :  
SELECT str FROM tableA WHERE str NOT IN (
	SELECT DISTINCT str FROM tableB
); 
SELECT a.str FROM tableA a LEFT JOIN tableB b ON a.str = b.str
WHERE b.str IS NULL;

대칭차집합:  
SELECT str FROM (
	SELECT str FROM tableA
	UNION ALL
	SELECT str FROM tableB
) AS tmp
GROUP BY str HAVING COUNT(*)=1
SELECT str FROM tableA WHERE str NOT IN ( SELECT DISTINCT str FROM tableB )
UNION ALL
SELECT str FROM tableB WHERE str NOT IN ( SELECT DISTINCT str FROM tableA )

교차 조인 :  
SELECT *
FROM EMPLOYEE CROSS JOIN DEPARTMENT;

# Group by 사용법

### MySQL에서 group by 로 문자열을 합칠땐 group_concat 을 이용한다.

1. 기본형 : group_concat(필드명)
2. 구분자 변경 : group_concat(필드명 separator '구분자')
3. 중복제거 : group_concat(distinct 필드명)
4. 문자열 정렬 : group_concat(필드명 order by 필드명)

Select Description  

AVG()	Return the average value of the argument  
BIT_AND()	Return bitwise and  
BIT_OR()	Return bitwise or  
BIT_XOR()	Return bitwise xor  
COUNT(DISTINCT)	Return the count of a number of different values  
COUNT()	Return a count of the number of rows returned  
GROUP_CONCAT()	Return a concatenated string  
MAX()	Return the maximum value  
MIN()	Return the minimum value  
STD()	Return the population standard deviation  
STDDEV_POP()	Return the population standard deviation  
STDDEV_SAMP()	Return the sample standard deviation  
STDDEV()	Return the population standard deviation  
SUM()	Return the sum  
VAR_POP()	Return the population standard variance  
VAR_SAMP()	Return the sample variance  
VARIANCE()	Return the population standard variance

# CAST

SELECT CAST('2020-10-19 12:35:29.123' AS DATE) AS 'DATE';
SELECT CAST('2020-10-19 12:35:29.123' AS TIME) AS 'TIME';
SELECT CAST('2020-10-19 12:35;29.123' AS DATETIME) AS 'DATETIME';
    
CAST (expression AS 데이터형식 [ (길이) ]);
CONVERT (expression , 데이터형식 [ (길이) ]);

DATETIME에서 DATE로 형 변환
SELECT ANIMAL_ID, NAME, DATE_FORMAT(DATETIME, '%Y-%m-%d') AS 날짜 
FROM ANIMAL_INS

# 문자열 처리

CONCAT(문자열1, 문자열2 ...)
CONCAT_WS(문자열1, 문자열2 ...)

SELECT LEFT('abcdefg', 3)
SELECT MID('abcdefg', 2, 4);
-- SELECT SUBSTR('abcdefg', 2, 4);
-- SELECT SUBSTRING('abcdefg', 2, 4);
SELECT RIGHT('abcdefg', 3);
REVERSE(문자열)

INSERT(기준 문자열, 위치, 길이, 삽입할 문자열)
SELECT INSERT('abcdefghi', 3, 4, '@@@@'), 
 > 'ab@@@@ghi'
INSERT('abcdefghi', 3, 2, '@@@@');
 > 'ab@@@@efghi'
 
 * REPLACE(문자열, 원래 문자열, 바꿀 문자열)
SELECT REPLACE('이것이 MySQL이다', '이것이', 'This is');
 > 'This is MySQL이다.'
 
SELECT UPPER('Abcdef'); UCASE
SELECT LOWER('Abcdef'); LCASE

SELECT TRIM(' aabbccbbaa ');
-- 또는 SELECT TRIM(BOTH FROM ' aabbccbbaa ');
SELECT TRIM(BOTH 'a' FROM 'aabbccbbaa');
SELECT TRIM(LEADING FROM ' aabbccbbaa ');
SELECT LTRIM(' aabbccbbaa ');
SELECT TRIM(LEADING 'a' FROM 'aabbccbbaa');
SELECT TRIM(TRAILING FROM ' aabbccbbaa ');
SELECT RTRIM(' aabbccbbaa ');
SELECT TRIM(TRAILING 'a' FROM 'aabbccbbaa');

SELECT LENGTH('안녕');
SELECT CHAR_LENGTH('Hello');
SELECT CHARACTER_LENGTH('Hello');

ASCII(아스키 코드), CHAR(숫자)

BIT_LENGTH(문자열), CHAR_LENGTH(문자열), LENGTH(문자열)

# 문자열 색인

ELT(위치 문자열1, 문자열2, ...)
SELECT ELT(2, '하나', '둘', '셋'),
/* 둘

FIELD(찾을 문자열, 문자열1, 문자열2, ...)
FIELD('둘', '하나', '둘', '셋'),
/* 2

FIND_IN_SET(찾을 문자열, 문자열 리스트)
FIND_IN_SET('둘', '하나,둘,셋'),
/* 2

INSTR(기준 분자열, 부분 문자열), 
INSTR('하나둘셋', '둘'),
/* 3

LOCATE(부분 문자열, 기준 문자열)
LOCATE('둘', '하나둘셋');
/% 3

# 수처리

BIN(숫자), HEX(숫자), OCT(숫자)
SELECT ABS(-5);
SELECT CEILING(4.6);
SELECT FLOOR(4.789);
SELECT ROUND(4.567, 2);
SELECT ROUND(4567, -2);
SELECT TRUNCATE(4.567, 2);
SELECT FORMAT(1234.5678, 0);
# 1,235
SELECT POW(2, 3);
SELECT MOD(15, 4);
SELECT GREATEST(15, 4, 21, 7);
SELECT LEAST(15, 4, 21, 7);

# 삼각함수
ACOS(숫자), ASIN(숫자), ATAN(숫자), ATAN2(숫자1, 숫자2), SIN(숫자), COS(숫자), TAN(숫자),  

#각도 
DEGREES(숫자), RADIANS(숫자), PI()

# 지수 로그
 * EXP(X), LN(숫자), LOG(숫자), LOG(밑수, 숫자), LOG2(숫자), LOG10(숫자)
 
#SIGN(숫자) = 1, 0, -1 로 반환

* CONV(숫자, 원래 진수, 변환할 진수)
> 숫자를 원래 진수에서 변환할 진수로 계산한다.
SELECT CONV('AA', 16, 2), 
> 16진수 AA를 2진수로 변환한 10101010 
SELECT CONV(100, 10, 8);
> 100을 8진수로 변환한 144

# 데이터 치환 전처리

IFNULL(수식1, 수식2)
SELECT ANIMAL_TYPE, IFNULL(NAME, "No name") AS NAME, SEX_UPON_INTAKE 
FROM ANIMAL_INS

CASE ~ WHEN ~ ELSE ~ END
SELECT ANIMAL_ID, NAME, 
CASE WHEN SEX_UPON_INTAKE LIKE "%Neutered%" OR SEX_UPON_INTAKE LIKE "%Spayed%" 
THEN "O" 
ELSE "X" 
END AS "중성화" 
FROM ANIMAL_INS

중복 제거하기
SELECT COUNT(A.NAME) count
FROM (SELECT NAME FROM ANIMAL_INS GROUP BY NAME) AS A
WHERE NAME IS NOT NULL
GROUP BY

IF(수식, 참, 거짓)

NULLIF(수식1, 수식2)

# 시간 계산

* CURDATE(), CURTIME(), NOW(), SYSDATE()
* DAYOFWEEK(날짜), MONTHNAME(), DAYOFYEAR(날짜), * QUARTER(날짜)
* LAST_DAY(날짜)
* MAKEDATE(연도, 정수)
* DATE(), TIME()
SELECT YEAR('2017-01-02 12:30:45');
SELECT MONTH('2017-01-02 12:30:45')
SELECT DAY('2017-01-02 12:30:45');
SELECT HOUR('2017-01-02 12:30:45');
SELECT MINUTE('2017-01-02 12:30:45');
SELECT SECOND('2017-01-02 12:30:45');
SELECT TIMESTAMPDIFF(QUARTER, '2017-03-01', '2018-03-28');
SELECT DATEDIFF('2018-03-28 23:59:59', '2017-03-01 00:00:00');
SELECT TIMESTAMPDIFF(SECOND, '2017-03-01', '2018-03-28');
SELECT TIMESTAMPDIFF(MINUTE, '2017-03-01', '2018-03-28');

SELECT ADDDATE('2020-01-01', INTERVAL 31 DAYS), ADDDATE('2020-01-01', INTERVAL 1 MONTH);

SELECT SUBDATE('2020-01-01', INTERVAL 31 DAYS), SUBDATE('2020-01-01', INTErVAL 1 MONTH);
         
시각 구하기(2)
SET @HOUR = -1;
SELECT
    (@HOUR := @HOUR +1) AS HOUR,
    (SELECT COUNT(*) FROM ANIMAL_OUTS WHERE HOUR(DATETIME) = @HOUR) AS COUNT
FROM ANIMAL_OUTS
WHERE @HOUR < 23
String, Date


* DATEDIFF(날짜1, 날짜2), TIMEDIFF(날짜1 또는 시간1, 날짜2 또는 시간2)
SELECT A.ANIMAL_ID, A.NAME
FROM ANIMAL_INS A, ANIMAL_OUTS B 
WHERE A.ANIMAL_ID = B.ANIMAL_ID 
ORDER BY DATEDIFF(A.DATETIME, B.DATETIME) 
LIMIT 2

* PERIOD_ADD(연월, 개월수), PEIOD_DIFF(연월1, 연월2)
SELECT RERIOD_ADD(202001, 11);
> 12
SELECT PERIOD_DIFF(202001, 201812);
> 13

# 고급 예문

set @변수 명 = xx;
or set @변수 := xx

/* 1. 사용자 변수 */
SET @IN_DELIMITER = '|';
SET @IN_DATA = '10|20|30||40|50||70|80|||90';
 
 
/* 구분자를 기준으로 로우(ROW) 데이터 생성 쿼리*/  
SELECT TRIM(SUBSTRING_INDEX(SUBSTRING_INDEX(A.DATA, @IN_DELIMITER, B.RN), @IN_DELIMITER, -1)) AS ROW_DATA  
FROM      
    (SELECT CASE  
           WHEN CONVERT( ( LENGTH(A.DATA) - LENGTH(REPLACE (A.DATA, @IN_DELIMITER, '') ) ) / LENGTH(','), UNSIGNED) > 0 
           THEN CONVERT( ( LENGTH(A.DATA) - LENGTH(REPLACE (A.DATA, @IN_DELIMITER, '') ) ) / LENGTH(',') + 1, UNSIGNED)
           ELSE 0  
           END AS DELIMITER_CNT, A.DATA  
    FROM (SELECT @IN_DATA DATA) A) 
/* [조건] 데이터 입력 */  
INNER JOIN (SELECT CAST(seq AS INT) as RN 
            FROM seq_1_to_1000) B 
ON (B.RN <= A.DELIMITER_CNT)  
;

# 프로그래머스 예문

동명
SELECT NAME,COUNT(*) COUNT 
FROM ANIMAL_INS 
WHERE NAME IS NOT NULL
GROUP BY NAME
HAVING COUNT > 1
ORDER BY NAME


SELECT
CASE WHEN F1.ID1 =F2.friend 
THEN F1.ID1
ELSE F1.ID2 
END AS ID
FROM FRIENDS F1, 
    (SELECT CASE WHEN ID1 = 'naneekgunpowder1886' 
     THEN ID2 
     ELSE ID1 
     END AS friend 
     FROM FRIENDS 
     WHERE ID1 = 'naneekgunpowder1886' 
        OR ID2 = 'naneekgunpowder1886') F2
WHERE (F1.ID1 = F2.friend 
       OR F1.ID2 = F2.friend) 
    AND (F1.ID1 != 'naneekgunpowder1886' 
         AND F1.ID2 != 'naneekgunpowder1886')
GROUP BY ID
ORDER BY count(*) DESC, ID
LIMIT 1;

# SELECT *,
# CASE WHEN ID1 = 'naneekgunpowder1886' 
#      THEN ID2 
#      ELSE ID1 
#      END AS friend 
# FROM FRIENDS 
# WHERE ID1 = 'naneekgunpowder1886' 
#         OR ID2 = 'naneekgunpowder1886'